# Merging data with pandas

A quick overview of the functionality is shown in [pandas cheatsheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)

For extensive documentation please see [pandas docs](http://pandas.pydata.org/pandas-docs/stable/merging.html)

In [1]:
import pandas as pd

Most frequently I join separate series by creating a DataFrame with a dict, like shown below.
pandas is able to figure out how deal with index, even if individual lengths of the series are not equal.

In [2]:
a = pd.Series(index=['a','b','c'], data=[1,2,3])
b = pd.Series(index=['a','b','d','f'], data=[1,2,3,4])
c = pd.Series(index=['a','b','g'],data=[1,2,3])

df = pd.DataFrame({'A':a,'B':b,'C':c})
df

     A    B    C
a  1.0  1.0  1.0
b  2.0  2.0  2.0
c  3.0  NaN  NaN
d  NaN  3.0  NaN
f  NaN  4.0  NaN
g  NaN  NaN  3.0

you may drop rows with incomplete data with `dropna`

In [3]:
df.dropna()

     A    B    C
a  1.0  1.0  1.0
b  2.0  2.0  2.0

## Try with time series

The main difference here is that we'll be working with `DataFrame` objects instead of series. 
These can be joined together with `join` method.

In [4]:
from tradingWithPython import yahooFinance, cboe
pd.options.display.max_rows = 6 
pd.options.display.precision = 2 #  decimal precision

In [5]:
volData = cboe.getHistoricData()
volData

Downloading VIX from http://www.cboe.com/publish/ScheduledTask/MktData/datahouse/vixcurrent.csv
Downloading VXV from http://www.cboe.com/publish/scheduledtask/mktdata/datahouse/vxvdailyprices.csv
Downloading VXMT from http://www.cboe.com/publish/ScheduledTask/MktData/datahouse/vxmtdailyprices.csv
Downloading VVIX from http://www.cboe.com/publish/scheduledtask/mktdata/datahouse/VVIXtimeseries.csv

              VIX   VVIX   VXMT    VXV
2004-01-02  18.22    NaN    NaN    NaN
2004-01-05  17.49    NaN    NaN    NaN
2004-01-06  16.73    NaN    NaN    NaN
...           ...    ...    ...    ...
2017-02-08  11.45  94.58  16.60  14.56
2017-02-09  10.88  89.59  16.35  14.17
2017-02-10  10.85  85.77  16.17  13.91

[3301 rows x 4 columns]

In [6]:
priceData = yahooFinance.getHistoricData(['SPY','VXX']).minor_xs('adj_close')
priceData

Downloading data:
 [*********************100%***********************]  2 of 2 complete

               SPY    VXX
1993-01-29   28.00    NaN
1993-02-01   28.20    NaN
1993-02-02   28.26    NaN
...            ...    ...
2017-02-08  229.24  18.88
2017-02-09  230.60  18.52
2017-02-10  231.51  18.21

[6054 rows x 2 columns]

In [7]:
fullData = volData.join(priceData)
fullData

              VIX   VVIX   VXMT    VXV     SPY    VXX
2004-01-02  18.22    NaN    NaN    NaN   85.52    NaN
2004-01-05  17.49    NaN    NaN    NaN   86.45    NaN
2004-01-06  16.73    NaN    NaN    NaN   86.53    NaN
...           ...    ...    ...    ...     ...    ...
2017-02-08  11.45  94.58  16.60  14.56  229.24  18.88
2017-02-09  10.88  89.59  16.35  14.17  230.60  18.52
2017-02-10  10.85  85.77  16.17  13.91  231.51  18.21

[3301 rows x 6 columns]

note that the index of `volData` is the same as `volData`

of course we can now use `dropna` to remove empty rows.

In [8]:
fullData.dropna()

              VIX   VVIX   VXMT    VXV     SPY       VXX
2009-01-30  44.84  98.72  43.78  44.60   70.16  26772.48
2009-02-02  45.52  96.48  43.28  43.91   69.95  26688.00
2009-02-03  43.06  92.25  42.17  42.24   70.93  25438.72
...           ...    ...    ...    ...     ...       ...
2017-02-08  11.45  94.58  16.60  14.56  229.24     18.88
2017-02-09  10.88  89.59  16.35  14.17  230.60     18.52
2017-02-10  10.85  85.77  16.17  13.91  231.51     18.21

[2022 rows x 6 columns]